dj-zhou/one-third-hal-stm32/one-third-hal/core/uart-console.c
#include "uart-console.h"
#include "console-cli.h"

#include <math.h>
#include <stdarg.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

// static uint8_t      console.level;
extern Cli_t        cli_;
extern CliCmdList_t cmd_list_[100];

// ============================================================================
#if defined( CONSOLE_IS_USED )

UART_HandleTypeDef hconsole_;

struct {
    char  buffer[_CONSOLE_BUFF_LEN];
    char* r_ptr;  // read pointer
    char* w_ptr;  // write pointer
} rb;

static void ConsoleSetChar( uint8_t* buf, uint32_t len );
// ============================================================================
// CLI related

// ============================================================================
// common used functions
// ----------------------------------------------------------------------------
#if defined( STM32F030x8 )
static void InitUartPinsAlter( GPIO_TypeDef* GPIOx_T, uint8_t pin_nT,
                               GPIO_TypeDef* GPIOx_R, uint8_t pin_nR,
                               uint32_t alter ) {
    GPIO_InitTypeDef GPIO_InitStructure = { 0 };
    // TX
    GPIO_InitStructure.Pin       = 1 << pin_nT;
    GPIO_InitStructure.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Pull      = GPIO_PULLUP;
    GPIO_InitStructure.Speed     = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStructure.Alternate = alter;
    HAL_GPIO_Init( GPIOx_T, &GPIO_InitStructure );
    // RX
    GPIO_InitStructure.Pin   = 1 << pin_nR;
    GPIO_InitStructure.Mode  = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Pull  = GPIO_PULLUP;
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init( GPIOx_R, &GPIO_InitStructure );
}
#endif  // STM32F030x8

// ----------------------------------------------------------------------------
#if defined( STM32F103xB ) || defined( STM32F107xC )
static void InitUartPins( GPIO_TypeDef* GPIOx_T, uint8_t pin_nT,
                          GPIO_TypeDef* GPIOx_R, uint8_t pin_nR ) {
    GPIO_InitTypeDef GPIO_InitStructure = { 0 };
    // TX
    GPIO_InitStructure.Pin   = 1 << pin_nT;
    GPIO_InitStructure.Mode  = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init( GPIOx_T, &GPIO_InitStructure );
    // RX
    GPIO_InitStructure.Pin   = 1 << pin_nR;
    GPIO_InitStructure.Mode  = GPIO_MODE_INPUT;
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init( GPIOx_R, &GPIO_InitStructure );
}
#endif  // STM32F103xB || STM32F107xC

// ----------------------------------------------------------------------------
#if defined( STM32F407xx ) || defined( STM32F427xx )
static void InitUartPinsAlter( GPIO_TypeDef* GPIOx_T, uint8_t pin_nT,
                               GPIO_TypeDef* GPIOx_R, uint8_t pin_nR,
                               uint32_t alter ) {
    GPIO_InitTypeDef GPIO_InitStructure = { 0 };
    // TX
    GPIO_InitStructure.Pin       = 1 << pin_nT;
    GPIO_InitStructure.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Pull      = GPIO_PULLUP;
    GPIO_InitStructure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStructure.Alternate = alter;
    HAL_GPIO_Init( GPIOx_T, &GPIO_InitStructure );
    // RX
    GPIO_InitStructure.Pin   = 1 << pin_nR;
    GPIO_InitStructure.Mode  = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Pull  = GPIO_PULLUP;
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init( GPIOx_R, &GPIO_InitStructure );
}
#endif  // STM32F407xx || STM32F427xx

// ----------------------------------------------------------------------------
#if defined( STM32F767xx )
static void InitUartPinsAlter( GPIO_TypeDef* GPIOx_T, uint8_t pin_nT,
                               GPIO_TypeDef* GPIOx_R, uint8_t pin_nR,
                               uint32_t alter ) {

    GPIO_InitTypeDef GPIO_InitStructure = { 0 };
    // TX
    GPIO_InitStructure.Pin       = 1 << pin_nT;
    GPIO_InitStructure.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Pull      = GPIO_PULLUP;
    GPIO_InitStructure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStructure.Alternate = alter;
    HAL_GPIO_Init( GPIOx_T, &GPIO_InitStructure );
    // RX
    GPIO_InitStructure.Pin   = 1 << pin_nR;
    GPIO_InitStructure.Mode  = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Pull  = GPIO_PULLUP;
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init( GPIOx_R, &GPIO_InitStructure );
}
#endif  // STM32F767xx

// ----------------------------------------------------------------------------
static void InitUartSettings( USART_TypeDef* USARTx, uint32_t baud_rate,
                              uint8_t len, char parity, uint8_t stop_b ) {

    hconsole_.Instance      = USARTx;
    hconsole_.Init.BaudRate = baud_rate;
    switch ( len ) {
    case 9:
        hconsole_.Init.WordLength = UART_WORDLENGTH_9B;
        break;
    case 8:
    default:
        hconsole_.Init.WordLength = UART_WORDLENGTH_8B;
        break;
    }

    switch ( stop_b ) {
    case 2:
        hconsole_.Init.StopBits = UART_STOPBITS_2;
        break;
    case 1:
    default:
        hconsole_.Init.StopBits = UART_STOPBITS_1;
        break;
    }

    switch ( parity ) {
    case 'O':
    case 'o':
        hconsole_.Init.Parity = UART_PARITY_ODD;
        break;
    case 'E':
    case 'e':
        hconsole_.Init.Parity = UART_PARITY_EVEN;
        break;
    case 'N':
    case 'n':
    default:
        hconsole_.Init.Parity = UART_PARITY_NONE;
        break;
    }
    hconsole_.Init.Mode         = UART_MODE_TX_RX;
    hconsole_.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
    hconsole_.Init.OverSampling = UART_OVERSAMPLING_16;
#if defined( STM32F767xx )
    hconsole_.Init.OneBitSampling         = UART_ONE_BIT_SAMPLE_DISABLE;
    hconsole_.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
#endif
    HAL_UART_Init( &hconsole_ );  // if != HAL_OK ??
}

// ----------------------------------------------------------------------------
void InitUartNvic( uint8_t ch ) {
    HAL_NVIC_SetPriority( ch, _CONSOLE_PREEMPTION_PRIORITY,
                          _CONSOLE_SUB_PRIORITY );
    HAL_NVIC_EnableIRQ( ch );
}

// ============================================================================
static void consoleWriteByte( char data ) {
    HAL_UART_Transmit( &hconsole_, ( uint8_t* )&data, 1, 10 );
}

// ============================================================================
static void consoleWriteStr( char* ptr ) {
    HAL_UART_Transmit( &hconsole_, ( uint8_t* )ptr, strlen( ptr ), 10 );
}

// ============================================================================
// no hardware to test it, need to test in the future
#if defined( _CONSOLE_USE_UART1_PA9PA10 ) && defined( USART1_EXISTS )
static void InitUSART1_PA9PA10( uint32_t baud_rate, uint8_t len, char parity,
                                uint8_t stop_b ) {
    // gpio setting
    utils.clock.enableGpio( GPIOA );
#if defined( STM32F103xB ) || defined( STM32F107xC )
    InitUartPins( GPIOA, 9, GPIOA, 10 );
#elif defined( STM32F407xx )
    InitUartPinsAlter( GPIOA, 9, GPIOA, 10, GPIO_AF7_USART1 );  // to verify
#endif
    // usart setting
    utils.clock.enableUart( USART1 );
    InitUartSettings( USART1, baud_rate, len, parity, stop_b );

    InitUartNvic( USART1_IRQn );

