dj-zhou/one-third-hal-stm32/one-third-hal/core/uart-console.c
    // __HAL_UART_ENABLE( &hconsole_ );
}
#endif  // _CONSOLE_USE_UART1_PA9PA10  && defined( USART1_EXISTS )

// ============================================================================
#if defined( _CONSOLE_USE_UART1_PB6PB7 ) && defined( USART1_EXISTS )
static void InitUSART1_PB6PB7( uint32_t baud_rate, uint8_t len, char parity,
                               uint8_t stop_b ) {
    // gpio setting
    utils.clock.enableGpio( GPIOB );
    InitUartPins( GPIOB, 6, GPIOB, 7 );
    // usart setting
    utils.clock.enableUart( USART1 );
    InitUartSettings( USART1, baud_rate, len, parity, stop_b );

    // these may work only for F103, F107, etc, will fix
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_AFIO_REMAP_USART1_ENABLE();

    InitUartNvic( USART1_IRQn );

    // __HAL_UART_ENABLE( &hconsole_ );
}
#endif  // _CONSOLE_USE_UART1_PA9PA10

// ---------------------------------------------------------------------------
#if defined( _CONSOLE_USE_UART1_PA9PA10 ) \
    || defined( _CONSOLE_USE_UART1_PB6PB7 )
#if defined( USART1_EXISTS )
void USART1_IRQHandler( void ) {
    // clear the interrupt flag
    USART1->SR &= ( uint16_t )~USART_FLAG_RXNE;
    // receive data
    uint8_t recv = ( uint8_t )( USART1->DR & ( uint16_t )0x01FF );
    ConsoleSetChar( &recv, 1 );
}
#endif
#endif  // _CONSOLE_USE_UART1_PA9PA10 || _CONSOLE_USE_UART1_PB6PB7

// ============================================================================
#if defined( _CONSOLE_USE_UART2_PA2PA3 ) && defined( USART2_EXISTS )
static void InitUSART2_PA2PA3( uint32_t baud_rate, uint8_t len, char parity,
                               uint8_t stop_b ) {
    // gpio setting
    utils.clock.enableGpio( GPIOA );
#if defined( STM32F103xB ) || defined( STM32F107xC )
    InitUartPins( GPIOA, 2, GPIOA, 3 );
#elif defined( STM32F407xx )
    InitUartPinsAlter( GPIOA, 2, GPIOA, 3, GPIO_AF7_USART2 );
#elif defined( STM32F030x8 )
    InitUartPinsAlter( GPIOA, 2, GPIOA, 3, GPIO_AF1_USART2 );
#endif
    // some special settings
    // GPIO_InitTypeDef GPIO_InitStruct = { 0 }; what are thtose??
    // HAL_GPIO_Init( GPIOA, &GPIO_InitStruct );
    // usart setting
    utils.clock.enableUart( USART2 );
    InitUartSettings( USART2, baud_rate, len, parity, stop_b );

    InitUartNvic( USART2_IRQn );

    // __HAL_UART_ENABLE( &hconsole_ );
}
#endif  // _CONSOLE_USE_UART2_PA2PA3 && defined( USART2_EXISTS )

// ============================================================================
#if defined( _CONSOLE_USE_UART2_PD5PD6 ) && defined( USART2_EXISTS )
// TODO
// STM32F107VCT6 does not have USART2 on these pins
static void InitUSART2_PD5PD6( uint32_t baud_rate, uint8_t len, char parity,
                               uint8_t stop_b ) {
    // gpio setting
    utils.clock.enableGpio( GPIOD );
    InitUartPins( GPIOD, 5, GPIOD, 6 );
    // usart setting
    utils.clock.enableUart( USART2 );
    InitUartSettings( USART2, baud_rate, len, parity, stop_b );

    // these may work only for F103, F107, etc, will fix
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_AFIO_REMAP_USART2_ENABLE();

    InitUartNvic( USART2_IRQn );

    // __HAL_UART_ENABLE( &hconsole_ );
}
#endif  // _CONSOLE_USE_UART2_PD5PD6 && defined( USART2_EXISTS )

// ---------------------------------------------------------------------------
#if defined( _CONSOLE_USE_UART2_PA2PA3 ) || defined( _CONSOLE_USE_UART2_PD5PD6 )
#if defined( USART2_EXISTS )
void USART2_IRQHandler( void ) {
    // those two might be combined
#if defined( STM32F030x8 )
    uint8_t recv;
    if ( ( __HAL_UART_GET_FLAG( &hconsole_, UART_FLAG_RXNE ) != RESET ) ) {
        HAL_UART_Receive( &hconsole_, &recv, 1, 1000 );
    }
    ConsoleSetChar( &recv, 1 );
#else
    // clear the interrupt flag
    USART2->SR &= ( uint16_t )~USART_FLAG_RXNE;
    // receive data
    uint8_t recv = ( uint8_t )( USART2->DR & ( uint16_t )0x01FF );
    ConsoleSetChar( &recv, 1 );
#endif
}
#endif
#endif  // _CONSOLE_USE_UART2_PA2PA3 || _CONSOLE_USE_UART2_PD5PD6

// ============================================================================
#if defined( _CONSOLE_USE_UART3_PB10PB11 ) && defined( USART3_EXISTS )
static void InitUSART3_PB10PB11( uint32_t baud_rate, uint8_t len, char parity,
                                 uint8_t stop_b ) {
    // gpio setting
    utils.clock.enableGpio( GPIOB );
    InitUartPins( GPIOB, 10, GPIOB, 11 );
    // usart setting
    utils.clock.enableUart( USART3 );
    InitUartSettings( USART3, baud_rate, len, parity, stop_b );

    // these may work only for F103, F107, etc, will fix
    __HAL_RCC_AFIO_CLK_ENABLE();
    InitUartNvic( USART3_IRQn );

    // __HAL_USART_ENABLE( &hconsole_ );
}
#endif  // _CONSOLE_USE_UART3_PB10PB11 && defined( USART3_EXISTS )

// ============================================================================
#if defined( _CONSOLE_USE_UART3_PC10PC11 ) && defined( USART3_EXISTS )
static void InitUSART3_PC10PC11( uint32_t baud_rate, uint8_t len, char parity,
                                 uint8_t stop_b ) {
    // gpio setting
    utils.clock.enableGpio( GPIOC );
    InitUartPins( GPIOC, 10, GPIOC, 11 );
    // usart setting
    utils.clock.enableUart( USART3 );
    InitUartSettings( USART3, baud_rate, len, parity, stop_b );

    // these may work only for F103, F107, etc, will fix
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_AFIO_REMAP_USART3_PARTIAL();

    InitUartNvic( USART3_IRQn );

    // __HAL_USART_ENABLE( &hconsole_ );
}
#endif  // _CONSOLE_USE_UART3_PC10PC11 && defined( USART3_EXISTS )

// ============================================================================
#if defined( _CONSOLE_USE_UART3_PD8PD9 ) && defined( USART3_EXISTS )
static void InitUSART3_PD8PD9( uint32_t baud_rate, uint8_t len, char parity,
                               uint8_t stop_b ) {
    // gpio setting
    utils.clock.enableGpio( GPIOD );
#if defined( STM32F767xx )
    InitUartPinsAlter( GPIOD, 8, GPIOD, 9, GPIO_AF7_USART3 );
#else
    InitUartPins( GPIOD, 8, GPIOD, 9 );
#endif
    // usart setting
    utils.clock.enableUart( USART3 );
    InitUartSettings( USART3, baud_rate, len, parity, stop_b );
#if !defined( STM32F767xx )
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_AFIO_REMAP_USART3_ENABLE();
#endif
    InitUartNvic( USART3_IRQn );

