dj-zhou/one-third-hal-stm32/one-third-hal/core/uart-console.c
static void CliEentHandle( void ) {
    char           read_char;
    static uint8_t label = 0;

    while ( ( read_char = console.read( 0 ) ) != 0 ) {
        if ( read_char == '\n' || read_char == '\r' ) {
            label = 0;
            if ( ( cli_.cmd_buff == cli_.cmd_buff_tail )
                 || ( cli_.cmd_buff[0] == ' ' ) ) {
                ;  // just do nothing
            }
            else {
                if ( *( --cli_.cmd_buff_tail ) == ' ' ) {
                    *cli_.cmd_buff_tail = '\0';
                }
                CliProcessCmd( cli_.cmd_buff );
                CliDeInit();
            }
            console.writeStr( cli_.out_message );
        }
        else {
            if ( read_char == 0x09 ) {
                CliTabCompletion();
            }
            // 0x7F is the key value of backspace on Linux
            else if ( read_char == 0x7F ) {
                CliBackspace();
            }
            else if ( ( read_char >= '\b' ) && ( read_char < ' ' ) ) {
                label = 0;

                if ( read_char == 0x1b && console.read( 0xffff ) == 0x5b ) {
                    CliDirection( console.read( 0xffff ) );
                }
            }
            else if ( ( read_char >= ' ' ) && ( read_char <= '~' ) ) {
                if ( read_char == '#' || label == 1 ) {
                    label = true;
                }
                else if ( ( cli_.cmd_buff_tail - cli_.cmd_buff )
                          < ( _CLI_CMD_MAX_LEN - 1 ) ) {
                    CliInput( read_char );
                }
            }
        }
    }
}

// ============================================================================
// clang-format off
Console_t console = {
    .level      = LOG_INFO          ,
    .config     = consoleConfig     ,
    .setTxMode  = consoleTxMode     ,
    .enableRxen = consoleEnableRxen ,
    .printk     = one_third_printk  ,
    .printf     = one_third_printf  ,
    .error      = consoleError      ,
    .writeByte  = consoleWriteByte  ,
    .writeStr   = consoleWriteStr   ,
    .read       = consoleGetChar    ,

    // cli related
    .cli.setLevel = consoleSetLevel ,
    .cli.regist   = CliRegisterCmd  ,
    .cli.process  = CliEentHandle   ,
};
// clang-format on

#endif  //  CONSOLE_IS_USED
